//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81866HwmSetup.uni>
//
// Description: HWM form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_F81866_HMM_CONFIGURATION                   #language eng "Hardware Monitor"
#string STR_F81866_HMM_CONFIGURATION_HELP              #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                  #language eng "Pc Health Status"
#string STR_F81866_FAN1_SETTING                         #language eng "Fan 1 Setting"
#string STR_F81866_FAN2_SETTING                         #language eng "Fan 2 Setting"
#string STR_F81866_FAN3_SETTING                         #language eng "Fan 3 Setting"

#string STR_F81866_SMF_CONFIGURATION                    #language eng "Smart Fan Function"
#string STR_F81866_SMF_CONFIGURATION_HELP               #language eng "Smart Fan function setting"
#string STR_F81866_SMARTFAN1_CONFIG                     #language eng "Smart Fan 1 Mode"            
                                                        #language x-UEFI-AMI "YSIO300"
#string STR_F81866_SMARTFAN2_CONFIG                     #language eng "Smart Fan 2 Mode"
                                                        #language x-UEFI-AMI "YSIO301"
#string STR_F81866_SMARTFAN3_CONFIG                     #language eng "Smart Fan 3 Mode"
                                                        #language x-UEFI-AMI "YSIO302"
#string STR_F81866_SMARTFAN_CONFIG_HELP                 #language eng "Smart Fan Mode Select"
#string STR_F81866_SMARTFAN_MODE0                       #language eng "Manual Mode"
#string STR_F81866_SMARTFAN_MODE1                       #language eng "Automatic Mode"
#string STR_F81866_FAN1_TYPE                            #language eng "Fan 1 Type"
                                                        #language x-UEFI-AMI "YSIO303"
#string STR_F81866_FAN2_TYPE                            #language eng "Fan 2 Type"
                                                        #language x-UEFI-AMI "YSIO304"
#string STR_F81866_FAN3_TYPE                            #language eng "Fan 3 Type"
                                                        #language x-UEFI-AMI "YSIO305"
#string STR_F81866_FAN_TYPE_HELP                        #language eng "Select fan type RPM/PWM"
#string STR_F81866_FAN_TYPE0                            #language eng "RPM"
#string STR_F81866_FAN_TYPE1                            #language eng "PWM"
#string STR_F81866_FAN1_MANUAL_CONTROL                  #language eng "Fan Speed"
                                                        #language x-UEFI-AMI "YSIO306"
#string STR_F81866_FAN2_MANUAL_CONTROL                  #language eng "Fan Speed"
                                                        #language x-UEFI-AMI "YSIO307"
#string STR_F81866_FAN3_MANUAL_CONTROL                  #language eng "Fan Speed"
                                                        #language x-UEFI-AMI "YSIO308"
#string STR_F81866_FAN_MANUAL_CONTROL_HELP              #language eng "Fan will work with this Manual PWM/RPM Value"
#string STR_F81866_FAN1_TEMP_IN                         #language eng "Tempurature select"
                                                        #language x-UEFI-AMI "YSIO309"
#string STR_F81866_FAN2_TEMP_IN                         #language eng "Tempurature select"
                                                        #language x-UEFI-AMI "YSIO30A"
#string STR_F81866_FAN3_TEMP_IN                         #language eng "Tempurature select"
                                                        #language x-UEFI-AMI "YSIO30B"
#string STR_F81866_TEMP_IN_HELP                         #language eng "tempurature input selection"
#string STR_F81866_TEMP_IN1                             #language eng "PECI"
#string STR_F81866_TEMP_IN2                             #language eng "Temperature 1"
#string STR_F81866_TEMP_IN3                             #language eng "Temperature 2"
#string STR_F81866_TEMP_IN4                             #language eng "Temperature 0"
#string STR_F81866_TEMP_IN5                             #language eng "IBX/TSI"
#string STR_F81866_TEMP_IN6                             #language eng "IBX PCH"
#string STR_F81866_TEMP_IN7                             #language eng "IBX MCH"
#string STR_F81866_TEMP_IN8                             #language eng "IBX maximum"
#string STR_F81866_FAN1_MULTI_TEMP                      #language eng "Multi temperature"
                                                        #language x-UEFI-AMI "YSIO30C"
#string STR_F81866_FAN1_MULTI_TEMP_HELP                 #language eng "Multi temperature support."
#string STR_F81866_FAN1_HYSTERESIS                      #language eng "Hysteresis"
                                                        #language x-UEFI-AMI "YSIO30D"
#string STR_F81866_FAN1_HYSTERESIS_HELP                 #language eng "Boundary hysteresis. (0~15). Segment will change when the temperature is over the boundary temperature and below the boundary deducts the hysteresis temperature."
#string STR_F81866_FAN1_BOUNDARY1                       #language eng "Boundary 1"
                                                        #language x-UEFI-AMI "YSIO30E"
#string STR_F81866_FAN1_BOUNDARY1_HELP                  #language eng "The first boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 1 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 2 register."
#string STR_F81866_FAN1_BOUNDARY2                       #language eng "Boundary 2"
                                                        #language x-UEFI-AMI "YSIO30F"
#string STR_F81866_FAN1_BOUNDARY2_HELP                  #language eng "The second boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 2 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 3 register."
#string STR_F81866_FAN1_BOUNDARY3                       #language eng "Boundary 3"
                                                        #language x-UEFI-AMI "YSIO310"
#string STR_F81866_FAN1_BOUNDARY3_HELP                  #language eng "The third boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 3 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 4 register."
#string STR_F81866_FAN1_BOUNDARY4                       #language eng "Boundary 4"
                                                        #language x-UEFI-AMI "YSIO311"
#string STR_F81866_FAN1_BOUNDARY4_HELP                  #language eng "The fourth boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 4 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 5 register."

#string STR_F81866_FAN1_SEGMENT1                        #language eng "Segment 1 Speed"
                                                        #language x-UEFI-AMI "YSIO312"
#string STR_F81866_FAN1_SEGMENT2                        #language eng "Segment 2 Speed"
                                                        #language x-UEFI-AMI "YSIO313"
#string STR_F81866_FAN1_SEGMENT3                        #language eng "Segment 3 Speed"
                                                        #language x-UEFI-AMI "YSIO314"
#string STR_F81866_FAN1_SEGMENT4                        #language eng "Segment 4 Speed"
                                                        #language x-UEFI-AMI "YSIO315"
#string STR_F81866_FAN1_SEGMENT5                        #language eng "Segment 5 Speed"
                                                        #language x-UEFI-AMI "YSIO316"
#string STR_F81866_FAN1_SEGMENT_HELP                    #language eng "This register is depending on the fan mode PWM-Expected PWM duty-cycle RPM-Relative expected fan speed (%) of the full speed."

#string STR_F81866_FAN2_HYSTERESIS                      #language eng "Hysteresis"
                                                        #language x-UEFI-AMI "YSIO317"
#string STR_F81866_FAN2_HYSTERESIS_HELP                 #language eng "Boundary hysteresis. (0~15). Segment will change when the temperature is over the boundary temperature and below the boundary deducts the hysteresis temperature."
#string STR_F81866_FAN2_BOUNDARY1                       #language eng "Boundary 1"
                                                        #language x-UEFI-AMI "YSIO318"
#string STR_F81866_FAN2_BOUNDARY1_HELP                  #language eng "The first boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 1 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 2 register."
#string STR_F81866_FAN2_BOUNDARY2                       #language eng "Boundary 2"
                                                        #language x-UEFI-AMI "YSIO319"
#string STR_F81866_FAN2_BOUNDARY2_HELP                  #language eng "The second boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 2 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 3 register."
#string STR_F81866_FAN2_BOUNDARY3                       #language eng "Boundary 3"
                                                        #language x-UEFI-AMI "YSIO31A"
#string STR_F81866_FAN2_BOUNDARY3_HELP                  #language eng "The third boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 3 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 4 register."
#string STR_F81866_FAN2_BOUNDARY4                       #language eng "Boundary 4"
                                                        #language x-UEFI-AMI "YSIO31B"
#string STR_F81866_FAN2_BOUNDARY4_HELP                  #language eng "The fourth boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 4 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 5 register."

#string STR_F81866_FAN2_SEGMENT1                        #language eng "Segment 1 Speed"
                                                        #language x-UEFI-AMI "YSIO31C"
#string STR_F81866_FAN2_SEGMENT2                        #language eng "Segment 2 Speed"
                                                        #language x-UEFI-AMI "YSIO31D"
#string STR_F81866_FAN2_SEGMENT3                        #language eng "Segment 3 Speed"
                                                        #language x-UEFI-AMI "YSIO31E"
#string STR_F81866_FAN2_SEGMENT4                        #language eng "Segment 4 Speed"
                                                        #language x-UEFI-AMI "YSIO31F"
#string STR_F81866_FAN2_SEGMENT5                        #language eng "Segment 5 Speed"
                                                        #language x-UEFI-AMI "YSIO320"
#string STR_F81866_FAN2_SEGMENT_HELP                    #language eng "This register is depending on the fan mode PWM-Expected PWM duty-cycle RPM-Relative expected fan speed (%) of the full speed."

#string STR_F81866_FAN3_HYSTERESIS                      #language eng "Hysteresis"
                                                        #language x-UEFI-AMI "YSIO321"
#string STR_F81866_FAN3_HYSTERESIS_HELP                 #language eng "Boundary hysteresis. (0~15). Segment will change when the temperature is over the boundary temperature and below the boundary deducts the hysteresis temperature."
#string STR_F81866_FAN3_BOUNDARY1                       #language eng "Boundary 1"
                                                        #language x-UEFI-AMI "YSIO322"
#string STR_F81866_FAN3_BOUNDARY1_HELP                  #language eng "The first boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 1 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 2 register."
#string STR_F81866_FAN3_BOUNDARY2                       #language eng "Boundary 2"
                                                        #language x-UEFI-AMI "YSIO323"
#string STR_F81866_FAN3_BOUNDARY2_HELP                  #language eng "The second boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 2 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 3 register."
#string STR_F81866_FAN3_BOUNDARY3                       #language eng "Boundary 3"
                                                        #language x-UEFI-AMI "YSIO324"
#string STR_F81866_FAN3_BOUNDARY3_HELP                  #language eng "The third boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 3 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 4 register."
#string STR_F81866_FAN3_BOUNDARY4                       #language eng "Boundary 4"
                                                        #language x-UEFI-AMI "YSIO325"
#string STR_F81866_FAN3_BOUNDARY4_HELP                  #language eng "The fourth boundary temperature:When temperature exceeds this boundary, expected FAN value will be loaded from segment 4 register.When temperature is under this (boundary – hysteresis), expected FAN value will be loaded from segment 5 register."

#string STR_F81866_FAN3_SEGMENT1                        #language eng "Segment 1 Speed"
                                                        #language x-UEFI-AMI "YSIO326"
#string STR_F81866_FAN3_SEGMENT2                        #language eng "Segment 2 Speed"
                                                        #language x-UEFI-AMI "YSIO327"
#string STR_F81866_FAN3_SEGMENT3                        #language eng "Segment 3 Speed"
                                                        #language x-UEFI-AMI "YSIO328"
#string STR_F81866_FAN3_SEGMENT4                        #language eng "Segment 4 Speed"
                                                        #language x-UEFI-AMI "YSIO329"
#string STR_F81866_FAN3_SEGMENT5                        #language eng "Segment 5 Speed"
                                                        #language x-UEFI-AMI "YSIO32A"
#string STR_F81866_FAN3_SEGMENT_HELP                    #language eng "This register is depending on the fan mode PWM-Expected PWM duty-cycle RPM-Relative expected fan speed (%) of the full speed."

//Multi temperature setting
#string STR_F81866_FAN1_TB                              #language eng "Tb"
                                                        #language x-UEFI-AMI "YSIO32B"
#string STR_F81866_FAN1_TB_HELP                         #language eng "This register is used to set the base temperature for FAN1 temperature adjustment. The FAN1 temperature is calculated according to the equation: TFAN1 = Tnow + (Ta – Tb)*Ct"
#string STR_F81866_FAN1_TA                              #language eng "Ta"
                                                        #language x-UEFI-AMI "YSIO32C"
#string STR_F81866_FAN1_TA_HELP                         #language eng "This selects which temperature to be used as Ta for Fan1 temperature adjustment."
#string STR_F81866_FAN1_CTUP                            #language eng "Ctup"
                                                        #language x-UEFI-AMI "YSIO32D"
#string STR_F81866_FAN1_CTUP_HELP                       #language eng "This selects the weighting of the difference between Ta and Tb if Ta is higher than Tb."
#string STR_F81866_FAN1_CTDN                            #language eng "Ctdn"
                                                        #language x-UEFI-AMI "YSIO32E"
#string STR_F81866_FAN1_CTDN_HELP                       #language eng "This selects the weighting of the difference between Ta and Tb if Ta is lower than Tb."
#string STR_F81866_FAN1_CT1                             #language eng "1"
#string STR_F81866_FAN1_CT2                             #language eng "1/2"
#string STR_F81866_FAN1_CT3                             #language eng "1/4"
#string STR_F81866_FAN1_CT4                             #language eng "1/8"
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
